# GroupSetIterator Class

---
An iterator to a group set.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGroupSetIterator
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public abstract class GroupSetIterator : APIObject,
    	IEnumerator

    Public MustInherit Class GroupSetIterator
    	Inherits APIObject
    	Implements IEnumerator

    public ref class GroupSetIterator abstract : public APIObject,
    	IEnumerator

    [<AbstractClassAttribute>]
    type GroupSetIterator =
        class
            inherit APIObject
            interface IEnumerator
        end
The GroupSetIterator type exposes the following members.
| Name| Description
---|---|---
| GroupSetIterator| For Internal Use Only.
Top
| Name| Description
---|---|---
| Current| Retrieves the item that is the current focus of the iterator.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| MoveNext| Move the iterator one item forward.
| Reset| Bring the iterator back to the start of the set.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace